/*
д стандарден влез се чита цел број N. Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 елементи), при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата.

Да се напише програма која за секоја низа ќе го испечати процентот на огледални еднакви броеви во низата. Огледални броеви во низа се првиот и последниот, вториот и претпоследниот итн. Доколку низата има непарен број на елементи, средниот елемент е и огледален и еднаков.

пример влез:

3
5 7 2 5 2 8
6 1 2 3 3 1 1
8 8 4 8 3 2 1 4 8
пример излез и објаснување:

60.00% (2,2,5 се огледални и еднакви -> 3/5 елементи -> 60%)
66.67% (1,1,3,3 се огледални и еднакви -> 4/6 елементи -> 66.67%)
50.00% (8,8,4,4 се огледални и еднакви -> 4/8 елементи -> 50.00%)
For example:

Input	Result
10
77 16 8 16 2 8 17 20 30 30 11 0 19 25 8 1 4 18 14 2 16 16 25 11 20 21 21 13 3 10 5 30 22 15 28 24 6 8 15 25 29 2 18 24 21 15 10 20 7 10 6 15 29 16 19 14 4 4 7 26 19 0 25 8 10 6 19 18 16 26 11 28 14 21 13 17 16 30
36 16 20 12 20 0 11 24 10 28 30 4 23 10 24 17 18 20 18 28 13 26 19 2 25 26 3 30 12 16 11 10 10 16 18 27 4
80 11 10 19 29 26 7 16 7 0 30 1 5 29 23 24 6 26 2 24 23 6 23 9 0 12 13 20 9 18 17 6 3 19 27 25 0 3 6 13 18 20 4 0 12 11 3 21 5 28 13 10 28 0 7 13 5 13 5 15 19 9 27 26 1 18 22 20 17 25 26 30 10 28 3 28 3 17 9 24 12
42 2 19 17 28 2 3 26 21 19 17 25 27 19 26 21 23 29 22 10 16 9 24 26 17 30 24 14 17 9 28 15 0 14 26 18 12 25 7 10 7 7 16
45 13 30 15 10 27 2 18 27 14 19 28 28 17 23 9 8 3 8 5 2 14 22 24 6 27 21 2 27 2 7 19 26 20 25 17 16 4 4 12 26 9 1 27 26 27
20 5 25 27 5 12 4 4 0 17 26 25 25 21 18 23 0 24 11 6 21
93 28 7 3 30 21 11 21 28 13 6 18 10 10 21 1 1 17 3 3 7 10 3 29 28 10 21 17 18 26 3 29 8 4 13 14 25 16 12 21 8 6 27 18 29 23 2 12 6 7 10 20 7 13 18 1 14 27 30 18 1 25 18 25 1 5 12 6 1 10 29 23 12 26 12 4 24 10 29 4 11 30 21 18 22 30 30 4 9 24 9 25 24 25
59 26 23 20 8 19 3 7 14 21 22 29 11 0 4 15 14 8 6 23 10 30 16 2 10 10 1 13 19 13 21 15 17 10 25 14 1 0 24 16 30 19 8 25 8 28 6 24 16 23 29 18 28 1 17 0 6 5 28 21
63 22 1 13 17 30 27 16 26 7 22 30 26 2 21 10 12 12 0 5 29 23 7 0 17 15 12 21 14 4 5 28 5 13 14 6 29 9 4 10 13 24 3 4 20 24 6 0 10 13 3 12 27 19 19 6 12 15 12 19 18 28 14 1
47 9 27 21 10 21 3 11 6 24 6 5 28 30 25 12 19 19 23 24 0 8 6 4 6 25 7 20 6 5 20 1 6 9 9 18 28 24 0 18 21 16 8 11 11 20 29 6

*/

#include<stdio.h>
int main(){
	int n,i,j,k,cekor_p=0,cekor_m=0,s,brojac=0;
	float rezultat=0,b1,k1;
	scanf("%d",&n);
	
	for(i=1;i<=n;i++){
		scanf("%d",&k);
		int niza[k];
		for(j=0;j<k;j++){
			scanf("%d",&niza[j]);		
		}
		for(s=0;s<k;s++){
			if(niza[cekor_p] == niza[(k-1)-cekor_m]){
				brojac++;
			}
			cekor_p++;
			cekor_m++;
		}
		b1 = brojac*1.0;
		k1 = k*1.0;
		rezultat = (b1/k1)*100;
		if(i<n){
			printf("%.2f%%\n",rezultat);	
		}else{
			printf("%.2f%%",rezultat);
		}
		
		b1 = 0;k1 = 0;rezultat = 0;cekor_p = 0 ;cekor_m = 0;brojac=0;
	}
return 0;	
}