/*
Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90. Секогаш се извлекуваат повеќе од 8 броја. Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.

Освен главната добивка, играчите играат и на џокер број. Џокер бројот се формира на следниот начин: Се слепуваат помалку значајните цифри од првите 7 извлечени броја, и на тој број се додаваат сите следни внесени броеви. Ваша задача е да го отпечатите така добиениот џокер број.

For example:

Input	Result
2 32 45 78 64 21 7 65 18 32 88 1 99
2258621


*/

#include<stdio.h>
int main(){
	int broj,i=1,bingo_broj=0;
	
	while(1){
		scanf("%d",&broj);
		if(broj<1 || broj>90){
			break;
		}		
		if(i<=7){
			bingo_broj = bingo_broj*10+broj%10;
		}else{
			bingo_broj += broj;
		}	
		i++;
	}
	
	printf("%d",bingo_broj);
		
	return 0;
}