/*
Во една компанија сите вработени користат еден централизиран систем, за кој им е креирана корисничка сметка. Корисничко име(username) на секој вработен се добива откако од матичниот број на вработениот ќе се земат деловите кои го даваат датумот на раѓање и ќе се пресмета вредноста:

ден * 100 + месец * 1000 + година
Така ако делот од матичниот број кој го дава датумот е 1103998, тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.

Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.

Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:

7 - доколку годината на раѓање е до 1960
8 - доколку годината на раѓање е помеѓу 1961 - 1980
9 - доколку годината на раѓање е помеѓу 1981 - 1999
Напомена: Се смета дека сите вработени се родени до 1999 година.

Програмата го враќа ваквото корисничко име за внес од тастатура кој е дел од матичниот број на некој вработен, како во примерот.

For example:

Input	Result
0112998
14098





*/

#include <stdio.h>

int main(){
	int del_maticen,den=0,mesec=0,godina=0;
	int korisnicko=0;
	
	scanf("%d",&del_maticen);
	
	den = (del_maticen / 100000) * 100;
	mesec = ((del_maticen /1000) % 100) * 1000;
	godina = (del_maticen % 1000) + 1000;
	korisnicko = den+mesec+godina;
	
		if(korisnicko / 10000 == 0){
			if(godina<=1960){
				korisnicko = korisnicko + 70000;
				printf("%d\n", korisnicko);	
			}else if(godina>=1961 && godina<=1980){
				korisnicko = korisnicko + 80000;
				printf("%d\n", korisnicko);	
			}else if(godina>=1981 && godina<=1999){
				korisnicko = korisnicko + 90000;
				printf("%d\n", korisnicko);	
			}
		}else{
			printf("%d\n", korisnicko);	
		}
	
	
	
	
    return 0;
}
