/*
Да се напише програма каде од тастатура се внесува еден седумцифрен број. Програмата печати DA доколку бројот е специјален, а NE во спротивно. Еден број е специјален доколку за него важи дека е делив со својата прва цифра и не е делив со збирот на последните две или доколку не е делив со својата втора цифра и не е делив со збирот на последните две. Да се внимава на делење со 0, т.е. да се испечати порака Nevaliden broj во таков случај.

For example:

Input	Result
1234567
DA



*/

#include<stdio.h>
int main(){
	
    int broj,c1=0,c2=0,c3=0;
    scanf("%d",&broj);
    
    c1 = broj/1000000;
    c2 = (broj/100000) % 10;
    c3 = (broj%10) + (broj%100) / 10;
    
    if(c1==0||c2==0||c3==0){
    	printf("Nevaliden broj");
	}else{
		if(((broj%c1==0) && (broj%c3!=0)) || (broj%c2!=0 && broj%c3!=0)){
    		printf("DA");
		}else{
			printf("NE");
		}	
	}
    
    
    return 0;
}