/*
Да се напише програма во која во даден опсег на природни броеви [m,n], ќе се најдат и отпечатат во нов ред сите броеви за кои важи дека збирот на бројот со неговата слика(број кој ги има истите цифри, но во обратен редослед) е помал или еднаков на двојната вредност на бројот. На крај да се отпечати и бројот на вакви броеви.

For example:

Input	Result
1 19
1
2
3
4
5
6
7
8
9
10
11
Vkupno: 11

*/
#include<stdio.h>
int main(){
	int m,n,i,j,k=0;
	int obraten;
	scanf("%d%d",&m,&n);
	
		for(i=m;i<=n;i++){
			obraten = 0;
			j = i;
			
				while(j!=0){
				      obraten=obraten*10+(j%10);
				      j=j/10;
				}
			
			if(obraten<=i){
				k++;
				printf("%d\n",i);
			}	
		}

	printf("Vkupno: %d",k);
	
	return 0;		
}