/*
Да се напише програма во која во даден опсег на природни броеви [a,b], ќе се најдат и отпечатат сите броеви чијшто збир на цифри кои се деливи со 2, но НЕ се деливи со 3, е поголем од 0 и е делив со 7. На крај да се отпечати и бројот на вакви броеви.

For example:

Input	Result
2000 4000
2048
2084
2148
2184
2228
2282
2348
2384
2408
2418
2438
2444
2458
2468
2478
2480
2481
2483
2485
2486
2487
2489
2498
2548
2584
2648
2684
2748
2784
2804
2814
2822
2834
2840
2841
2843
2845
2846
2847
2849
2854
2864
2874
2894
2948
2984
3248
3284
3428
3482
3824
3842
Vkupno: 52

*/
#include<stdio.h>
int main(){
	
	int a,b,m,n,cifra=0,zbir=0,k=0;
	scanf("%d%d",&a,&b);
	
	for(m=a;m<=b;m++){
		for(n=m;n!=0;n/=10){
			cifra = n % 10;
				if(cifra%2==0 && cifra%3!=0){
					zbir = zbir + cifra;
				}
		}
		
		if(zbir>0 && zbir%7==0){
			printf("%d\n",m);
			k++;
		}
		zbir = 0;
		cifra = 0;
	}
	
	printf("Vkupno: %d",k);
	return 0;		

}
