/*
Од тастатура се чита еден непарен цел број n кој е поголем или еднаков на 5. Со помош на знакот * да се исцрта песочен часовник, кој има основи со должина n, како што е во примерот подолу, за n=5:

*****
 * * 
  *
 * *
*****
For example:

Input	Result
9
*********
 *     * 
  *   *  
   * *   
    *    
   * *   
  *   *  
 *     * 
*********


*/
#include<stdio.h>
int main(){
	int n,i,j;
	scanf("%d",&n);
	
	if(n>=5){
		for(i=0;i<n;i++){
			for(j=0;j<n;j++){
				if(i==0 || i==n-1){
					printf("*");	
				}else if(j==i || j==n-i-1){
					printf("*");
				}else{
					printf(" ");
				}
			}
			printf("\n");
		}
	}
	
	return 0;		
}