/*
Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение. Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.

На пример, ако е дадена следната матрица:

1 2 3 9 8
5 5 5 5 5 
0 1 2 0 0 
9 1 2 3 4 
1 1 1 1 1
должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред.

For example:

Input	Result
2
1 2 
2 1
2

*/

#include<stdio.h>
#define MAX 100
int main(){
	int m,i,j,counter=1,max=0;
	int matrica[MAX][MAX]={0};
	scanf("%d",&m);
	
	for(i=0;i<m;i++){
		for(j=0;j<m;j++){
			scanf("%d",&matrica[i][j]);
		}
	}
	
	for(i=0;i<m;i++){
		for(j=0;j<m-1;j++){
			if(matrica[i][j]<matrica[i][j+1]){
				counter++;
			}
		}
		if(counter>max){
			max = counter;
		}
		counter=1;
	}
	printf("%d",max);


}
