/*
Да се напише рекурзивна функција која што прима еден аргумент - број x која што ќе враќа 1 доколку секоја цифра во бројот е поголема од претходната, а во спротивно0.

Пример бројот 12345 е растечки, додека пак бројот 12325 не е растечки број.

Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати порака DA или NE (во нов ред), доколку бројот е растечки или не е растечки.

*/

#include<stdio.h>
int rastecki(int n){
    if(n<10){
        return 1;
    }else{
        return ((n%10)>(n/10)%10) && rastecki(n/10);
    }
}

int main(){
    int k,n,i;
    scanf("%d",&k);
    for(i=0;i<k;i++){
        scanf("%d",&n);
        if(rastecki(n)){
            printf("DA\n");
        }else{
            printf("NE\n");
        }
    }
    return 0;
}